app/views/events/index.html.erb

SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "events"
---
<h1><%= pluralize(@events.size, 'Event') %></h1>