app/controllers/editors_controller.rb

  def show
    @editor = Editors.find(params[:id])
---
SELECT  "editors".* FROM "editors"  WHERE "editors"."id" = ? LIMIT 1  [["id", 1]]