app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "events" SET "description" = ?, "fee" = ?, "location" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["description", ""], ["fee", 7.0], ["location", "U"], ["updated_at", "2014-07-30 21:48:58.078671"]]
---
  def update
    @event = Event.find(params[:id])
    @event.update(event_params)

INSERT INTO "events" ("created_at", "description", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-30 22:57:44.249097"], ["description", ""], ["location", ""], ["title", "New"], ["updated_at", "2014-07-30 22:57:44.249097"]]
---
  def create
    @event = Event.new(event_params)
    @event.save